tap "dimentium/autoraise"
tap "homebrew/services"
# Simple, modern, secure file encryption
brew "age"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Searches a binary image for embedded files and executable code
brew "binwalk"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Emacs text editor
brew "emacs"
# Emacs dependency management
brew "cask"
# Cross-platform make
brew "cmake"
# Linux virtual machines
brew "lima"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# Isolated development environments using Docker
brew "docker-compose"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Modern, maintained replacement for ls
brew "eza"
# Fast web fuzzer written in Go
brew "ffuf"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU debugger
brew "gdb"
# GitHub command-line tool
brew "gh"
# OpenType text shaping engine
brew "harfbuzz"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Directory/file & DNS busting tool written in Go
brew "gobuster"
# Network logon cracker which supports many services
brew "hydra"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# GNU utilities for networking
brew "inetutils"
# Development kit for the Java programming language
brew "openjdk"
# Dex to Java decompiler
brew "jadx"
# Featureful UNIX password cracker
brew "john", link: false
# Enhanced version of john, a UNIX password cracker
brew "john-jumbo"
# Image manipulation library
brew "jpeg"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Sophisticated file transfer program
brew "lftp"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# GNOME XML library
brew "libxml2"
# C XSLT library for GNOME
brew "libxslt"
# Platform built on V8 to build network applications
brew "node"
# Quickly generate a temporary email address
brew "mailsy"
# Java-based project management
brew "maven"
# Open source relational database management system
brew "mysql-client"
# Netwide Assembler (NASM) is an 80x86 assembler
brew "nasm"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Web server scanner
brew "nikto"
# Port scanning utility for large networks
brew "nmap"
# Send push notifications to your phone or desktop via PUT/POST
brew "ntfy"
# SSL/TLS VPN implementing OSI layer 2 or 3 secure network extension
brew "openvpn"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Generic machine emulator and virtualizer
brew "qemu"
# Tools for and transforming and inspecting PDF files
brew "qpdf"
# Retargetable machine-code decompiler based on LLVM
brew "retdec"
# UNIX-like reverse engineering framework and command-line toolset
brew "rizin"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# SMB/CIFS file, print, and login server for UNIX
brew "samba"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Penetration testing for SQL injection and database servers
brew "sqlmap"
# Easiest, most secure way to use WireGuard and 2FA
brew "tailscale", restart_service: :changed
# TCP/IP packet demultiplexer
brew "tcpflow"
# Programmatically correct mistyped console commands
brew "thefuck"
# Simplified and community-driven man pages
brew "tldr"
# Anonymizing overlay network for TCP
brew "tor", restart_service: :changed
# Use SOCKS-friendly applications with Tor
brew "torsocks"
# Vulnerability scanner for container images, file systems, and Git repos
brew "trivy"
# Find and verify credentials
brew "trufflehog"
# Internet file retriever
brew "wget"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Android SDK component
cask "android-platform-tools"
# Text, code, and markup editor
cask "bbedit"
# Reverse engineering platform powered by Rizin
cask "cutter"
# Cross-platform Text Expander written in Rust
cask "espanso"
# Web browser
cask "firefox"
# Screenshot software
cask "flameshot"
# Software reverse engineering (SRE) suite of tools
cask "ghidra"
# Utility to hide menu bar items
cask "hiddenbar"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Penetration testing framework
cask "metasploit"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Control your tools with a few keystrokes
cask "raycast"
# Easy to use text extraction tool
cask "trex"
# Open-source code editor
cask "visual-studio-code"
# Free and open source web app scanner
cask "zap"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "redhat.java"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
